In [1]:
import pandas as pd
import lxml

In [2]:
import pandas as pd

pd.set_option('display.max_columns', None)
pd.set_option('display.width', 200)
pd.set_option('display.max_colwidth', None)

In [3]:
pd.read_html("https://www.fdic.gov/bank-failures/failed-bank-list")

[                                                Bank Name                City          State   Cert                Acquiring Institution       Closing Date  Fund  Sort ascending
 0                       Metropolitan Capital Bank & Trust             Chicago       Illinois  57488              First Independence Bank   January 30, 2026                 10550
 1                            The Santa Anna National Bank          Santa Anna          Texas   5520            Coleman County State Bank      June 27, 2025                 10549
 2                                    Pulaski Savings Bank             Chicago       Illinois  28611                      Millennium Bank   January 17, 2025                 10548
 3                      The First National Bank of Lindsay             Lindsay       Oklahoma   4134               First Bank & Trust Co.   October 18, 2024                 10547
 4                   Republic First Bank dba Republic Bank        Philadelphia   Pennsylvania  27332    Fulton Bank, National Association     April 26, 2024                 10546
 5                                           Citizens Bank            Sac City           Iowa   8758            Iowa Trust & Savings Bank   November 3, 2023                 10545
 6                                Heartland Tri-State Bank             Elkhart         Kansas  25851               Dream First Bank, N.A.      July 28, 2023                 10544
 7                                     First Republic Bank       San Francisco     California  59017            JPMorgan Chase Bank, N.A.        May 1, 2023                 10543
 8                                          Signature Bank            New York       New York  57053                  Flagstar Bank, N.A.     March 12, 2023                 10540
 9                                     Silicon Valley Bank         Santa Clara     California  24735  First Citizens Bank & Trust Company     March 10, 2023                 10539
 10                                      Almena State Bank              Almena         Kansas  15426                          Equity Bank   October 23, 2020                 10538
 11                             First City Bank of Florida   Fort Walton Beach        Florida  16748            United Fidelity Bank, fsb   October 16, 2020                 10537
 12                                   The First State Bank       Barboursville  West Virginia  14361                       MVB Bank, Inc.      April 3, 2020                 10536
 13                                     Ericson State Bank             Ericson       Nebraska  18265           Farmers and Merchants Bank  February 14, 2020                 10535
 14                       City National Bank of New Jersey              Newark     New Jersey  21111                      Industrial Bank   November 1, 2019                 10534
 15                                          Resolute Bank              Maumee           Ohio  58317                   Buckeye State Bank   October 25, 2019                 10533
 16                                  Louisa Community Bank              Louisa       Kentucky  58112    Kentucky Farmers Bank Corporation   October 25, 2019                 10532
 17                                   The Enloe State Bank              Cooper          Texas  10716                   Legend Bank, N. A.       May 31, 2019                 10531
 18                    Washington Federal Bank for Savings             Chicago       Illinois  30570                   Royal Savings Bank  December 15, 2017                 10530
 19        The Farmers and Merchants State Bank of Argonia             Argonia         Kansas  17719                          Conway Bank   October 13, 2017                 10529
 20                                    Fayette County Bank          Saint Elmo       Illinois   1802            United Fidelity Bank, fsb       May 26, 2017                 10528
 21  Guaranty Bank, (d/b/a BestBank in Georgia & Michigan)           Milwaukee      Wisconsin  30003  First-Citizens Bank & Trust Company        May 5, 2017                 10527
 22                                         First NBC Bank         New Orleans      Louisiana  58302                         Whitney Bank     April 28, 2017                 10526
 23                                          Proficio Bank  Cottonwood Heights           Utah  35495                    Cache Valley Bank      March 3, 2017                 10525
 24                          Seaway Bank and Trust Company             Chicago       Illinois  19328                  State Bank of Texas   January 27, 2017                 10524]

In [4]:
import numpy as np

In [5]:
d={'a':[1,2,np.nan],'b':[2,3,np.nan]}

In [6]:
df = pd.DataFrame(d)

In [7]:
df

     a    b
0  1.0  2.0
1  2.0  3.0
2  NaN  NaN

In [8]:
df.dropna()

     a    b
0  1.0  2.0
1  2.0  3.0

In [9]:
df.drop(1)

     a    b
0  1.0  2.0
2  NaN  NaN

* deletes at most 1 non element row

In [10]:
df.dropna(thresh=1)

     a    b
0  1.0  2.0
1  2.0  3.0

In [11]:
df = df.assign(c=[2, 3, np.nan])

In [12]:
df

     a    b    c
0  1.0  2.0  2.0
1  2.0  3.0  3.0
2  NaN  NaN  NaN

In [13]:
df.dropna(thresh=1)

     a    b    c
0  1.0  2.0  2.0
1  2.0  3.0  3.0

In [14]:
df.loc[len(df)] = [1,np.nan, np.nan]

In [15]:
df

     a    b    c
0  1.0  2.0  2.0
1  2.0  3.0  3.0
2  NaN  NaN  NaN
3  1.0  NaN  NaN

In [16]:
df.dropna(thresh=1)

     a    b    c
0  1.0  2.0  2.0
1  2.0  3.0  3.0
3  1.0  NaN  NaN

In [17]:
df

     a    b    c
0  1.0  2.0  2.0
1  2.0  3.0  3.0
2  NaN  NaN  NaN
3  1.0  NaN  NaN

In [18]:
df.dropna(thresh=2)

     a    b    c
0  1.0  2.0  2.0
1  2.0  3.0  3.0

In [19]:
df['a'].mean()

np.float64(1.3333333333333333)

* Keep rows that have at least 3 non-NaN value

In [20]:
df.dropna(thresh=3)

     a    b    c
0  1.0  2.0  2.0
1  2.0  3.0  3.0

In [21]:
student= {
    "names": [
        "Ankit",
        "Rohit",
        "Sneha",
        "Priya",
        "Aman"
    ],

    "marks": [
        [85, 78, 90],   # Ankit → Maths, Physics, CS
        [70, 88, 75],   # Rohit
        [92, 91, 89],   # Sneha
        [60, 65, 58],   # Priya
        [80, 85, 82]    # Aman
    ],

    "attendance_percent": [
        92.5,
        88.0,
        96.3,
        75.4,
        90.1
    ]
}

In [22]:
s= pd.DataFrame(student)

In [23]:
s

   names         marks  attendance_percent
0  Ankit  [85, 78, 90]                92.5
1  Rohit  [70, 88, 75]                88.0
2  Sneha  [92, 91, 89]                96.3
3  Priya  [60, 65, 58]                75.4
4   Aman  [80, 85, 82]                90.1

In [27]:
s.groupby('attendance_percent').sum(numeric_only=True)

Empty DataFrame
Columns: []
Index: [75.4, 88.0, 90.1, 92.5, 96.3]

In [28]:
s['total_marks'] = s['marks'].apply(sum)

In [29]:
s

   names         marks  attendance_percent  total_marks
0  Ankit  [85, 78, 90]                92.5          253
1  Rohit  [70, 88, 75]                88.0          233
2  Sneha  [92, 91, 89]                96.3          272
3  Priya  [60, 65, 58]                75.4          183
4   Aman  [80, 85, 82]                90.1          247

* describe gives all the mathematical statistics related to thee data

In [30]:
s.describe().T

                    count    mean        std    min    25%    50%    75%    max
attendance_percent    5.0   88.46   7.925465   75.4   88.0   90.1   92.5   96.3
total_marks           5.0  237.60  33.582734  183.0  233.0  247.0  253.0  272.0

* **count** → number of non-NaN (valid) values
* **mean** → average of the values
* **std** → standard deviation, showing data spread around the mean
* **min** → smallest value in the column
* **25%** → first quartile (25% of values are below or equal to this)
* **50%** → median (middle value of the data)
* **75%** → third quartile (75% of values are below or equal to this)
* **max** → largest value in the column